## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:60" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:60" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:369b681330fe4ec936fa4157c008f9f520a12ef681d45eb7a0dc5614e1323ab7" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:6bb52bc13b5a2c9d1e44e6dd0beb6f2e3576d187edc84082bfcf21b4a37905f9"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 60 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-cpfValidation must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-cpfValidation" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "b529144a16516034d0bcef5abd1b1525-5" -> "a21d1afb9823dd99998715e8a2b32ba2"
      ~ id                     = "cpfValidation.cfd18db7028e9d1e1304ab4f4ffbfcff.zip" -> (known after apply)
      ~ key                    = "cpfValidation.cfd18db7028e9d1e1304ab4f4ffbfcff.zip" -> "cpfValidation.a21d1afb9823dd99998715e8a2b32ba2.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "cfd18db7028e9d1e1304ab4f4ffbfcff" -> "a21d1afb9823dd99998715e8a2b32ba2"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "YIbgeHF5ltyLHfWYU16qA3TP565zgl.0" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-excelToJson must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-excelToJson" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "62cbe2ab505c6efc0ab11fc0809ba84d-6" -> "16dfc311d55a06b8f3c185aa5126d2cd"
      ~ id                     = "excelToJson.0eaf165ba62ffc297722ca4895ab194a.zip" -> (known after apply)
      ~ key                    = "excelToJson.0eaf165ba62ffc297722ca4895ab194a.zip" -> "excelToJson.16dfc311d55a06b8f3c185aa5126d2cd.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "0eaf165ba62ffc297722ca4895ab194a" -> "16dfc311d55a06b8f3c185aa5126d2cd"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "FM4u_yqBttN8QW3IozaQ6IoyGrMnEvvl" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-graphql must be replaced
+/- resource "aws_s3_object" "lambda_artifact-graphql" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "dbe9e36effff36a5b5f95953ed4f5c59-6" -> "a24bce37e7362c690600d1ab95dc6f6e"
      ~ id                     = "graphql.e4448d8a0e2fcc75d4d423b693b40ef5.zip" -> (known after apply)
      ~ key                    = "graphql.e4448d8a0e2fcc75d4d423b693b40ef5.zip" -> "graphql.a24bce37e7362c690600d1ab95dc6f6e.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "e4448d8a0e2fcc75d4d423b693b40ef5" -> "a24bce37e7362c690600d1ab95dc6f6e"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "3EXhezGUwZNkDBU0uruD4qUSpRMh73nY" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "f35dfdfd5fa09624fbc7fa4440ff66fd" -> "8e2d941391344bcab7e6b2d9f25c9adc"
        id                     = "dist/200.html"
      ~ source_hash            = "f35dfdfd5fa09624fbc7fa4440ff66fd" -> "8e2d941391344bcab7e6b2d9f25c9adc"
        tags                   = {}
      ~ version_id             = "2sJF.jyWqV64t5vFx6waDKnOb_AKJpCq" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "0c326201931c8b39e9f561a7b8a95faa" -> "9bf377b8b535c7e68273b3437f4c6e11"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "0c326201931c8b39e9f561a7b8a95faa" -> "9bf377b8b535c7e68273b3437f4c6e11"
        tags                   = {}
      ~ version_id             = "L1zqhoJAw40Q5812mw_4Ri5Ysc7DarKg" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "f08d3fa50bf0744d59cd43fb36e50e1c" -> "94f081a63365905b2cd602ea71b8105f"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "f08d3fa50bf0744d59cd43fb36e50e1c" -> "94f081a63365905b2cd602ea71b8105f"
        tags                   = {}
      ~ version_id             = "P1LJ0aPz7nltj8_j4oSF_121GSEnfirt" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "f35dfdfd5fa09624fbc7fa4440ff66fd" -> "8e2d941391344bcab7e6b2d9f25c9adc"
        id                     = "dist/index.html"
      ~ source_hash            = "f35dfdfd5fa09624fbc7fa4440ff66fd" -> "8e2d941391344bcab7e6b2d9f25c9adc"
        tags                   = {}
      ~ version_id             = "OHOcSYsuyV3NqyV34sVWgcW.E0Rfk1FD" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadsPage.bb0182a1.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "a6a5f7d785ca9e3cdf219486287d1a62"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadUploadsPage.bb0182a1.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadsPage.bb0182a1.chunk.js"
+       source_hash            = "a6a5f7d785ca9e3cdf219486287d1a62"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadsPage.bb0182a1.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "43ff778014632a7ef9766fd4374290b4"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadUploadsPage.bb0182a1.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadsPage.bb0182a1.chunk.js.LICENSE.txt"
+       source_hash            = "43ff778014632a7ef9766fd4374290b4"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadsPage.c105414b.chunk.js"] will be destroyed
  # (because key ["static/js/UploadUploadsPage.c105414b.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "1e655b06164ce9d7f43f68e29db344d7" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadUploadsPage.c105414b.chunk.js" -> null
-       key                    = "dist/static/js/UploadUploadsPage.c105414b.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadsPage.c105414b.chunk.js" -> null
-       source_hash            = "1e655b06164ce9d7f43f68e29db344d7" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "2DMPVVqFZFir93xIFi4t9Exu4LEUDF7P" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadsPage.c105414b.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UploadUploadsPage.c105414b.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "43ff778014632a7ef9766fd4374290b4" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadUploadsPage.c105414b.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UploadUploadsPage.c105414b.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadsPage.c105414b.chunk.js.LICENSE.txt" -> null
-       source_hash            = "43ff778014632a7ef9766fd4374290b4" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "h5KyBgeHyeBsT_SFQYbWvxoEYLKUnCwx" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.38202ff3.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "49b58ecfec104f953c242172d53293bf"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.38202ff3.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.38202ff3.js"
+       source_hash            = "49b58ecfec104f953c242172d53293bf"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.38202ff3.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "b703266ba347d460c07ac79899e011fa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.38202ff3.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.38202ff3.js.LICENSE.txt"
+       source_hash            = "b703266ba347d460c07ac79899e011fa"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.ca1dc6bb.js"] will be destroyed
  # (because key ["static/js/app.ca1dc6bb.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "3f7369d06b2cf192a4a0a4dede7befd3" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.ca1dc6bb.js" -> null
-       key                    = "dist/static/js/app.ca1dc6bb.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.ca1dc6bb.js" -> null
-       source_hash            = "3f7369d06b2cf192a4a0a4dede7befd3" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "5KWGh4GNHOdNaTanQ5Wa9Mn7k4U6wIUR" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.ca1dc6bb.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.ca1dc6bb.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b703266ba347d460c07ac79899e011fa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.ca1dc6bb.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.ca1dc6bb.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.ca1dc6bb.js.LICENSE.txt" -> null
-       source_hash            = "b703266ba347d460c07ac79899e011fa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "nVkHiPCtRvnVaD3_8uajMcvvRSrMkbK_" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.7bb81fc6.js"] will be destroyed
  # (because key ["static/js/runtime-app.7bb81fc6.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "3c818a3563d4242cc92aab15c57fba32" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/runtime-app.7bb81fc6.js" -> null
-       key                    = "dist/static/js/runtime-app.7bb81fc6.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.7bb81fc6.js" -> null
-       source_hash            = "3c818a3563d4242cc92aab15c57fba32" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = ".sGcPuhafWjhZ8rJSuCmiTPNPb9F76B9" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.e4e1bc01.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "3da77b5968ae28dbb72b25b692b699c0"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/runtime-app.e4e1bc01.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.e4e1bc01.js"
+       source_hash            = "3da77b5968ae28dbb72b25b692b699c0"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-03-26T18:13:30.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:29" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:29/invocations" -> (known after apply)
      ~ s3_key                         = "cpfValidation.cfd18db7028e9d1e1304ab4f4ffbfcff.zip" -> "cpfValidation.a21d1afb9823dd99998715e8a2b32ba2.zip"
        tags                           = {}
      ~ version                        = "29" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "345b779e2974e2267a57151b82c4dcb2ae74eb5f" -> "1091d3e789b0e214f7fc0587922e090db066cec8"
              ~ "DD_TAGS"                      = "git.commit.sha:345b779e2974e2267a57151b82c4dcb2ae74eb5f,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:1091d3e789b0e214f7fc0587922e090db066cec8,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "345b779e2974e2267a57151b82c4dcb2ae74eb5f" -> "1091d3e789b0e214f7fc0587922e090db066cec8"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "29" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-excelToJson"
      ~ last_modified                  = "2024-03-26T18:13:35.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:29" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:29/invocations" -> (known after apply)
      ~ s3_key                         = "excelToJson.0eaf165ba62ffc297722ca4895ab194a.zip" -> "excelToJson.16dfc311d55a06b8f3c185aa5126d2cd.zip"
        tags                           = {}
      ~ version                        = "29" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "345b779e2974e2267a57151b82c4dcb2ae74eb5f" -> "1091d3e789b0e214f7fc0587922e090db066cec8"
              ~ "DD_TAGS"                      = "git.commit.sha:345b779e2974e2267a57151b82c4dcb2ae74eb5f,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:1091d3e789b0e214f7fc0587922e090db066cec8,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "345b779e2974e2267a57151b82c4dcb2ae74eb5f" -> "1091d3e789b0e214f7fc0587922e090db066cec8"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "29" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ last_modified                  = "2024-03-26T18:13:32.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:76" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:76/invocations" -> (known after apply)
      ~ s3_key                         = "graphql.e4448d8a0e2fcc75d4d423b693b40ef5.zip" -> "graphql.a24bce37e7362c690600d1ab95dc6f6e.zip"
        tags                           = {}
      ~ version                        = "76" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "345b779e2974e2267a57151b82c4dcb2ae74eb5f" -> "1091d3e789b0e214f7fc0587922e090db066cec8"
              ~ "DD_TAGS"                            = "git.commit.sha:345b779e2974e2267a57151b82c4dcb2ae74eb5f,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:1091d3e789b0e214f7fc0587922e090db066cec8,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "345b779e2974e2267a57151b82c4dcb2ae74eb5f" -> "1091d3e789b0e214f7fc0587922e090db066cec8"
                # (17 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "76" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 12 to add, 8 to change, 12 to destroy.
```

</details>

*Pusher: @laurelkorwin, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8457203684)*